       IDENTIFICATION DIVISION.
      * ... 

       ENVIRONMENT DIVISION.
      * ...

       DATA DIVISION.
      * ...

       PROCEDURE DIVISION.
      * contains the actual program code
      * section names here are optional can be freely chosen

       ALPHA SECTION.                                                       
       ALPHA-1.
      *    some code
       ALPHA-2.
      *    some more code
      *    ...                                                          

       OMEGA SECTION.
       OMEGA-1.
      *    even more code
      *    ...
       OMEGA-k.
      *    that's enough code for now