       IDENTIFICATION DIVISION.
      * information about the current program 
       PROGRAM-ID.
      * name of the program/subroutine
      * more optional paragraphs such as DATE-WRITTEN or -COMPILED...
      
       ENVIRONMENT DIVISION.
      * how to interact with external files and machines
       CONFIGURATION SECTION.
      * declare machines
       INPUT-OUTPUT SECTION.
      * connect physical and logical files

       DATA DIVISION.
      * the data processed by the current program
       FILE SECTION.
      * declare internal files
       WORKING-STORAGE SECTION.
      * declare variables and records for the program

       PROCEDURE DIVISION.
      * contains the actual program code
      * section names here are optional can be freely chosen

       MYFIRST SECTION.                                                 
      * arbitrary section name