       IDENTIFICATION DIVISION.

       PROGRAM-ID.     Dom_Program.
      ****************************
       DATA DIVISION.
       LOCAL-STORAGE SECTION.
       01  var PIC 9999.
      ****************************
       PROCEDURE DIVISION.
           DISPLAY "[SUB] Greetings from the domprogram!".

       END PROGRAM Dom_Program.
