       IDENTIFICATION DIVISION.

       PROGRAM-ID.     Sub_Program.
      ****************************
       DATA DIVISION.
       LOCAL-STORAGE SECTION.
       01  var PIC 9999.
      ****************************
       PROCEDURE DIVISION.
           DISPLAY "[SUB] Greetings from the subprogram!".

      END PROGRAM Sub_Program.
